---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightType.Dispose
source: html/b9c1777b-a7e0-286d-b52b-730269c0523f.htm
---
# Autodesk.Revit.DB.Lighting.LightType.Dispose Method

Releases all resources used by the LightType

## Syntax (C#)
```csharp
public void Dispose()
```